package Bases._2_BasicConcepts;

/*
 * 标识符:
 *      标识符由字母 数字 _ $ 组成; 其中不能以数字开头 , 不能是Java中的关键字
 * 注意事项:
 *      在编写时尽量不要使用数字, 例如i1  i2
 *      命名时尽量有意义 , 不要使用a b 这样的标识符. 例如Student  Math 这样都属于有意义的内容
 *      Java中标识符区分大小写 , 例如mldn  Mldn  mlDn表示3个不同的标识符
 *      对于$符号 , 是由特殊意义的, 不要去使用, 将在内部类中详解
 */
public class Identifier {
    /*
     * 关键字:
     *
     * 注意事项:
     *      Java有两个未使用到的关键字: goto(在其它语言中表示无条件跳转) const(在其他语言中表示常量)
     *      JDK1.4之后增加了assert关键字
     *      JDK之后增加了enmu(枚举)关键字
     *      Java有3个特殊含义的标记(严格来讲不算是关键字): false true null
     */


    /*
     * 注:
     *      JDK1.7之后, 标识符支持中文(类名称 变量名 ...) 实际开发中建议使用英文
     */
}
