package Bases._1_Start;

public class _2_Annotation {

    //  单行注释
    /*
     * 就是在注释内容前面颊双斜线(//), Java编译器在进行程序编译时会自动忽略这部分信息
     * */


    /*
    多行注释
    */
    /*
     * 就是在注释内容前面以单斜线加一个星形标记('/*')开头, 并在注释内容末尾以一个星形标记加一个单斜线(*'\'/)
     * 但注释内容超过一行时一般采用这种方法
     * */

    /**
     * 文档注释
     */
    /*
     * 是以单斜线加两个星形标记(/ **)开头, 一一个星形标记加单斜线(* /)结束, 用这种方式注释的信息会被解释成程序
     * 的正式文档, 并能包含进 如 javadoc 工具生成的文档里, 用以说明该程序的结构层次及其方法
     *
     * 在文档注释中提供了许多类似于"@auther" 的标记, 例如 参数类型, 返回值, 方法说明等.
     * */
}
